{
    "displayName":  "Allow connection from Trusted locations",
    "state":  "enabled",
    "conditions":  {
        "applications":  {
             "includeApplications":  [
                 "All"
            ]
         },
        "users":  {
             "includeUsers":  [
                  "All"
              ]
         },
        "locations":  {
             "includeLocations":  [
                  "16a120a5-9a23-4e38-8ce9-b704cb823d69"
              ]
        }
    },
    "grantControls":  {
        "operator":  "OR",
        "builtInControls":  [
        "mfa"
              ]
          }
}
    
