{
    "displayName": "Block Legacy Authentication",
    "state": "enabled",
    "conditions": {
        "clientAppTypes": [
            "exchangeActiveSync",
            "other"
        ],
        "applications": {
            "includeApplications": [
                "All"
            ]
        },
        "users": {
            "includeUsers": [
                "All"
                ]
            }
        },
        "grantcontrols":  {
            "operator":  "OR",
            "builtInControls":  [
                "block"
            ]
        }
    }
