{
    "displayName": "Block Legacy Authentication",
    "state": "enabled",
    "sessionControls": null,
    "conditions": {
        "clientAppTypes": [
            "exchangeActiveSync",
            "other"
        ],
        "platforms": null,
        "locations": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [
                "All"
            ]
        },
        "users": {
            "includeUsers": [
                "All"
                ]
            }
        },
        "grantcontrols":  {
            "operator":  "OR",
            "builtInControls":  [
                "0"
            ]
        }
    }
