{
    "displayName": "Block Legacy Authentication",
    "state": "enabled",
    "sessionControls": null,
    "conditions": {
        "clientAppTypes": [
            "exchangeActiveSync",
            "other"
        ],
        "platforms": null,
        "locations": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [
                "All"
            ]
        },
        "users": {
            "includeUsers": [
                "All"
            ],
            "excludeUsers": [],
            "includeGroups": [],
            "excludeGroups": [
                
            ],
            "includeRoles": [],
            "excludeRoles": []
        },
        "GrantControls":  {
                          "operator":  "OR",
                          "builtInControls":  [
                                    "0"
                                  ]
                      }
    }
}
