{
    "displayName":  "Blocking sign-ins for users attempting to use legacy authentication protocols",
    "state":  "enabled",
    "sessionControls":  null,
    "conditions":  {
                       "userRiskLevels":  [

                                          ],
                       "signInRiskLevels":  [

                                            ],
                       "clientAppTypes":  [
                                              "exchangeActiveSync",
                                              "other"
                                          ],
                       "platforms":  null,
                       "locations":  null,
                       "applications":  {
                                            "includeApplications":  [
                                                                        "All"
                                                                    ],
                                            "excludeApplications":  [

                                                                    ],
                                            "includeUserActions":  [

                                                                   ],
                                            "includeAuthenticationContextClassReferences":  [

                                                                                            ]
                                        },
                       "users":  {
                                     "includeUsers":  [
                                                          "All"
                                                      ],
                                     "excludeUsers":  [

                                                      ],
                                     "includeGroups":  [

                                                       ],
                                     "excludeGroups":  [

                                                       ],
                                     "includeRoles":  [

                                                      ],
                                     "excludeRoles":  [

                                                      ]
                                 }
                   },
    "grantControls":  {
                          "operator":  "OR",
                          "builtInControls":  [
                                                  "block"
                                              ],
                          "customAuthenticationFactors":  [

                                                          ],
                          "termsOfUse":  [

                                         ]
                      }
}
