{
    "displayName":  "Block legacy authentication",
    "state":  "enabledForReportingButNotEnforced",
    "sessionControls":  null,
    "conditions":  {
                       "clientAppTypes":  [
                                              "exchangeActiveSync",
                                              "other"
                                          ],
                       "applications":  {
                                            "includeApplications":  [
                                                                        "All"
                                                                    ]
                                        },
                       "users":  {
                                     "includeUsers":  [
                                                          "All"
                                                      ]
                                 }
                   },
    "grantControls":  {
                          "operator":  "OR",
                          "builtInControls":  [
                                                  "block"
                                              ]
                      }
}
