{
    "displayName": "Click2Run - Require MFA for Azure Management",
    "state": "enabledForReportingButNotEnforced",
    "sessionControls": null,
    "conditions": {
        "platforms": null,
        "locations": null,
        "applications": {
            "includeApplications": [
                "797f4846-ba00-4fd7-ba43-dac1f8f63013"
            ],
        },
        "users": {
            "includeUsers": [
                "All"  
            ]
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "mfa"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": []
    }
}
