{
    "displayName": "Require MFA for All Users",
    "state": "enabledForReportingButNotEnforced",
    "sessionControls": null,
    "conditions": {
        "platforms": null,
        "locations": null,
        "applications": {
            "includeApplications": [
                "All"
            ],
        },
        "users": {
            "includeUsers": [
                "All"  
            ]
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "mfa"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": []
    }
}
