{
    "displayName": "Require MFA for Admin Accounts",
    "state": "enabled",
    "sessionControls": null,
    "conditions": {
        "signInRiskLevels": [],
        "clientAppTypes": [],
        "platforms": null,
        "locations": null,
        "applications": {
            "includeApplications": [
                "All"
            ],
            "excludeApplications": [],
            "includeUserActions": []
        },
        "users": {
            "includeUsers": [],
            "includeGroups": [],
            "excludeGroups": [
                "f753047e-de31-4c74-a6fb-c38589047723"
            ],
            "includeRoles": [
                "62e90394-69f5-4237-9190-012177145e10",
                "29232cdf-9323-42fd-ade2-1d097af3e4de",
                "fe930be7-5e62-47db-91af-98c3a49a38b1",
                "194ae4cb-b126-40b2-bd5b-6091b380977d",
                "3a2c62db-5318-420d-8d74-23affee5d9d5",
                "b1be1c3e-b65d-4f19-8427-f6fa0d97feb9",
                "17315797-102d-40b4-93e0-432062caca18",  
            ],
            "excludeRoles": []
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "mfa"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": []
    }
}
